var Duoyinzi=new function(){
	this.fire= function (tokens){
		for(var idxSentence=0;idxSentence<tokens.length;idxSentence++){
			var token=tokens[idxSentence];
			var hzPPP="#";if(idxSentence>=3){hzPP=tokens[idxSentence-3]["hanzi"];}
			var hzPP="#";if(idxSentence>=2){hzPP=tokens[idxSentence-2]["hanzi"];}
			var hzP="#";if(idxSentence>=1){hzP=tokens[idxSentence-1]["hanzi"];}
			var hanzi=token["hanzi"];
			var hzN="#";if(idxSentence<=tokens.length-2){hzN=tokens[idxSentence+1]["hanzi"];}
			var hzNN="#";if(idxSentence<=tokens.length-3){hzNN=tokens[idxSentence+2]["hanzi"];}
			var hzNNN="#";if(idxSentence<=tokens.length-4){hzNN=tokens[idxSentence+3]["hanzi"];}
			var subSentence=hzPPP+hzPP+hzP+hanzi+hzN+hzNN+hzNNN;
			var bestWeightValue=0;
			for(var i=0;i<token["pinyins"].length;i++){
				var pinyin=token["pinyins"][i];
				var weightValue=this.get(hanzi,pinyin,subSentence);
				if (weightValue>bestWeightValue){
					bestWeightValue=weightValue;
					token["pinyin"]=pinyin;
				}
			}
		}
		
		return tokens;
	}
	
	this.get= function (hanzi,pinyin,subSentence){
		var ret=0;
		ret=this.decideByRegExp(hanzi,pinyin,subSentence);
		if (ret>0)return ret;
		return 0;
	}
	this.decideByRegExp= function (hanzi,pinyin,subSentence){
		var regexp=this.regExps[hanzi+pinyin];
		if (regexp!=null){
			if (typeof regexp=="string"){
				if (subSentence.search(new RegExp(regexp))>-1){
					return 100;
				}
			}else if (typeof regexp=="object"){//配列の場合
				for(var i=0;i>regexp.length;i++){
					if (subSentence.search(new RegExp(regexp[i]))>-1){
						return 100;
					}
				}
			}
		}
		return 0;
	}
	this.regExps={
		"少shao4"	:"^.老夫少妻|^.老的少的|^..[^多不至缺很甚很极或最鲜]少[迈忌鹏德华武良凡云陵北]|^..[泰]少|^.[许众诸]多少[男女年]|^(从老到|一老一|二老一|两老一|三老一|连老带|是老是|遗老遗|有老有|老老少|.老老)少|^...少儿不宜|^..[^缺不多]少([男女][^人孩性生性]|年[^纪轻]|时[^间日候])|^..[大二三四恶年老]少|^..[^多不至缺很甚很极或最]少(统帅|公爵|侯爵|尊者|王子|教主|城主|师父|东家|奶奶|门主|公子|掌门|伯爵|忠勇王|郡王|亲王|帝君|家主|夫人|团长|军团长|帅|族长|府|[校女年尉爷妇林商泽冲主侠甫卿男监壮阳帝主])|^..[^多不至缺很甚很极或最少]少将[^近]|^..[^多不至缺很甚很极或最少]少保[^留]",
		"大dai4"		:"(?!^.*(三闾|上官|监|国|卿|屈原|谏议|光禄|御史|荣禄|士|爵|礼|郎|学|侍|阴|大中|中散|遗书|刑|皇|太中)).*(?=^...大夫[^人]).+$",
		"了liao3"	:"^..[个是]了局|^..[^坏错犯误做办跑出有没起成]了事[^态情先实端发前故后业件小理事物主]|^...了不得|^.不甚了了|^不甚了了|^...了了之|^..[走了笑]了之[^后]|^.直[截接]了当|^..一了百了|^一了百了|^...了[若如]指掌|^...了结[^果界局实束构论婚合尾晶绳结识成盟交巴]|^.#末了|^...了不起[^眼]|^..[#能]了却|^...了却([了#]|[残一余毕]生|心[愿事]|一[段个])|^...了断[#吗]|^.自刎了断|^...了得[#了啊地的之吗或就呢么罢也而]|^.身手了得|^.如此了得|^简单明了|^没完没了|^...了然[^后而]|^...了悟[^空]|^..不了|^...了解[^开决禁释说救除渴恨咒方药围降惑放离悟剖脱毒答]",
		"好hao4"		:"^...好(大喜功|逸恶劳|高骛远|管闲事|吃懒做|为人师|高务远)|^...好事者|^..[^好只幸]好学[^生问校会员好]|^...好学好问|^.好学好问|^...好色|^...好奇[^怪]|^...好战[^争死生术袍壕斗备果盔友败士船局场马机前力线舰略甲上]|^..[喜爱]好",
		"煞sha1"		:"^...煞[车住]|^...煞风景",
		"骨gu1"		:"^...骨[嘟朵碌]",
		"猫mao2"		:"^...猫腰",
		"雀qiao3"	:"^.[小老]家雀|^..家雀[儿]",
		"场chang2"	:"^...场院",
		"的di4"		:"^...的放矢|^..标的物|^众矢之的|^一[语言]中的|^.[^题数眼满悦刺入醒怒面头盲耳侧夺炫瞩注项节眩瞑触眉张白显科心反账鼠赤条名深惊瞪瞠帐嗔举环]目的",
		"的di2"		:"^.#这的是|^...的的确确|^...的确[^切实定信立认保凿乎]|^.[^极多两西顶一末远争异南下前杖弊终尖端事鼻后左无北韦上东底拳笔棒不尾锅高万云始外战那指里平开]端的|^...的士[^兵气卒人子族籍藉家绅林大官多]|^...的卢[^比龙人植大朐城生水梭士照溪师布氏山西庆卡塞斯克幽麒老]",
		"莎suo1"		:"^..青莎|^...莎草",
		"汗han2"		:"^..[可思]汗|^[^身头脸面淋冒流急满禁][^身头脸面淋冒流急满禁]大汗[^淋珠衫腾流][^腾雨流]",//这个还不太好
		"钥yao4"		:"^...钥匙",
		"匙shi"		:"^..钥匙",
		"一yi1"		:"^...一#|^..[第统万十唯惟]一[^个]|^.[里中]挑一[^个]|^.[^驱]逐一[^个]|^.[^单惟唯]独一[^个份]|^.[^为随付与总将幻较]之一[^个]|^(始终|心口|表里|挚爱|信任|整齐|神念|古板|融会|连贯|步伐|浑融|浑然|冷暖|动作|进退|生死|恩爱|品质|大小|远近|人龙|淡定|深浅|光滑|君臣)如一[^个]|^.[^当起最]初一[^样看个]",
		"葛ge2"		:"^..[纠瓜长藤重]葛|^...葛[尔]",
		"嘘shi1"		:"^..#嘘#",
		"可ke4"		:"^...可汗",
		"禅shan4"	:"^..封禅|^...禅[让位]",
		"琢zuo2"		:"^...琢磨",
		"朴pu3"		:"^...朴刀",
		"的di"		:"^..怎的",
		"个ge3"		:"^..自个",
		"厦xia4"		:"^...厦[门钨]",
		"叨tao1"		:"^...叨扰",
		"扁pian1"	:"^...扁[舟梭]",
		"碌liu4"		:"^...碌碡",
		"倘chang2"	:"^...倘佯",
		"吱zhi1"		:"^..[^吱咯嘎喀噶]吱(声|个声|一声|了)",
		"咖ga1"		:"^...咖[哩喱]",
		"涡guo1"		:"^..[^漩]涡[河口水]",
		"绰chao1"	:"^..[^阔]绰起",
		"蚂ma4"		:"^...蚂蚱",
		"说shui4"	:"^...说客|^..游说",
		"骠biao1"	:"^...骠马",
		"绷beng3"	:"^..[^紧绷]绷(脸|面孔|[^紧带](脸|面孔)|[^紧带].(脸|面孔))",
		"豁huo4"		:"^...豁[然达免朗亮]",
		"擂lei4"		:"^..打擂|^..擂[台主]",
		"要yao1"		:"^...要[求挟]",
		"辟pi4"		:"^..复辟",
		"畜xv4"		:"^...畜[养牧产积]|^..[不积]畜",
		"巷hang4"	:"^...巷道",
		"阿e1"		:"^...阿[谀房弥胶附堵]|^.[^中]东阿",
		"六lu4"		:"^...六(安|合县)",
		"甚shen2"	:"^...甚么",
		"论lun2"		:"^...论语",
		"跑pao2"		:"^..虎跑泉",
		"并bing1"	:"^...并州",
		"泥ni4"		:"^..拘泥|^...泥古",
		"殷yan1"		:"^...殷红",
		"宛yvan1"	:"^..大宛",
		"轴zhou4"	:"^..压轴",
		"吁yv4":		"^..[呼攻]吁",
		"裳shang"	:"^..衣裳",
		"呐ne4"		:"^...呐呐|^..呐呐",
		"哗hua1"		:"^...哗哗|^..哗哗|^..#哗#|^..[^喧]哗[拉啦地的得]",
		"服fu4"		:"^..[几两]服|^..一服药",
		"贾gu3"		:"^..[商巨富大市]贾|^...贾贩",
		"浆jiang4"	:"^...浆糊",
		"哇wa"		:"^..[^#哇]哇#",
		"刷shua4"	:"^...刷白",
		"咧lie1"		:"^..[^瞎]咧咧|^.[^瞎]咧咧",
		"咧lie2"		:"^..瞎咧咧|^.瞎咧咧",
		"咧lie"		:"^[^嘴][^嘴][^嘴一]咧#",
		"会kuai4"	:"^...(会稽|会计[^较算划谋画])",
		"没mo4"		:"^...没[于在入]|^..[覆淹隐沉湮辱埋吞抄罚浸贪泯陷掩消遗]没|^..[^没]遮没[^拦]|^.[^走蹿跑露飞迎汇伸打逃推不射发掏装外冲瞧而传演吐发]出没[^有]",
		"汤shang1"	:"^.浩浩汤汤|^浩浩汤汤",
		"壳qiao4"	:"^..[脱地]壳",
		"吧ba1"		:"^...吧[唧塔叽员椅主嗒台哒]|^..[眨酒咯喀砸咂迪鸡网泡书]吧",
		"读dou4"		:"[^一那]句读[^尽着]",
		"削xve1"		:"^..剥削|^...削[弱减]|^...削.*[发藩户职兵爵]",
		"化hua1"		:"^...化钱|^..叫化子",
		"其ji1"		:"^.郦食其",
		"几ji1"		:"^..茶几|^...几[乎率微至]",
		"体ti1"		:"^...体己",
		"似shi4"		:"^...似的",
		"见xian4"	:"^...见牛羊|^..匕见",
		"觉jiao4"	:"^..睡觉|.*睡.*[^感]觉|^.*一.*觉.*睡|^.*(一觉醒来|一觉醒.来|一觉.醒)|^..好觉[^察得]",
		"正zheng1"	:"^...正月",
		"便pain2"	:"^...便宜",
		"同tong4"	:"^..胡同",
		"什shen2"	:"^...什.*[麽么]",
		"胳ge2"		:"^..骨胳|^...胳肢",
		"亲qing4"	:"^...亲家[^庭族]",
		"拓ta4"		:"^...拓[图印本片件下版画在油映]|^.*[模墨字].*拓",
		"淋lin4"		:"^..[被]淋病",
		"龟jvn1"		:"^...龟[裂坼纹]",
		"龟qiu1"		:"^...龟兹",
		"撇pie1"		:"^...撇[开清]",
		"句gou1"		:"^..高句骊",
		"卜bo"		:"^..萝卜",
		"嚷rang1"	:"^.*嚷嚷",
		"藉ji2"		:"^..狼藉",
		"哑ya3"		:"^..[咿哑]哑",
		"屏bing3"	:"^...屏[除退住息气弃神声]",
		"角jve2"		:"^...角[逐色]|^..主角",
		"郎lang4"	:"^.屎壳郎",
		"吗ma2"		:"^..干吗",
		"吗ma3"		:"^...吗啡",
		"呢ni2"		:"^...呢[喃子料轿制]|^.*呢呢咕咕",
		"奇ji1"		:"...奇点[^点了燃醒击名头]|^...奇[偶数]",
		"答da1"		:"^.*[^回]答[应允答嘴腔理讪茬]|^..[滴喀啪嘀溜]答|^..不答应|^..带答不理",
		"嘎ga3"		:"-..[二张不]嘎[^嘎吱]",
		"泡pao1"		:"^...泡.*[尿涕痰屎浓唾]|^.*[拉脓撒涕尿].*泡|^.一大泡|^..眼泡",
		"眯mi2"		:"^.*沙.*眯[^着].*眼",
		"挨ai1"		:"^...挨[碰次挨个家户人在门到]|^...挨[^#]*[坐近紧排桌床边村蹭墙靠触身]|^...挨着[^罚饿刀打揍骂枪宰欺拳掌脚棍冷]|^..紧挨|^.一.挨一.|^..挨挨",
		"拧ning4"	:"^...拧([可死折肯]|战死|不过)",
		"拧ning2"	:"^...拧.*(眉|眼|脸|巾|热毛|水|干|耳)|(眉|眼|脸|巾|热毛|水|干|耳).*拧|^...拧(在一起|成)",//这个还不太好
		"难nan4"		:"^..[非愚船靖宇挡矿脱罹山救赴死空灾苦大患遇避逃海有国解危磨受责劫落刁殉诘蒙一]难|^...难[民兄弟]|^..血难之灾|^幸免于难|^多灾多难|^.[^如因为从]此难[^以得免关有]|^.[^越]发难[^以]|^.人急难",
		"钉ding4"	:"^..[^铜铁钢铆弩丝]钉([出封钉在上下死入进满着成得住穿到好过于射中著回尸它棺牢个向]|家俱|马掌|狗窝|一下|十字架|不死)|^..[^铜钉铁钢铆弩丝]钉了|^...钉起来",
		"给ji3"		:"^..[供补]给|^...给[予养]|^..自给自|^粮.自给",
		"括gua1"		:"^..搜括",
		"氏zhi1"		:"^..月氏",
		"笼long3"	:"^..箱笼|^...笼[罩统络]",
		"吵chao1"	:"^.[^闹哄争]吵吵[^嚷闹架攘][^嚷闹架攘]|^..[^闹哄争]吵吵[^嚷闹架攘][^嚷闹架攘]",
		"瓦wa4"		:"^...瓦刀",
		"予yv2"		:"^...予.予|^.予.予",
		"埋man2"		:"^...埋怨",
		"雨yv4"		:"^密云不雨",
		"子zi"		:["^..[琐枝砾盔伐噪苇隔簿雁枣窠蹬橙胰摺坡崖疠坳铐杈颈亮凹坑豁埂丘巾锞捣殃痨囊袄聒炮棂眉獾脯陀扒月榧藓痱瘌页瘊屑楞蒿毽磙痦瓤喇棕喜娟牯圆席状蹶邦拉蛏幛毛浆签健闷窖铊幡穗秧凛扳圃毡番娄索卡耙篱什租围犯兜盅辨掴嚼瘤沟潭挫缸键佬腕刚帕花伟巴鸨狐衬丁环绺獐海岭窝窨腔撅甸蛾块串姑回冷狸啥钎捻捧脸瘫鞑槌媒箍座杖店汊汗强媚锁啦沫鸡筐势楼岛网楔猫腻姨碴衫耍栀阁桂锄钗憨竿勾舀碾狗驼疤粱犊票拔坨油挑揽杠狍桔蛮榫晃牢驴集愣壶河稻腰虾妈褶屯篓尺梅谱堂瓢机档摆框号底郐猛方帮骡剪墩厂盆滩卒兵拍顶条腱杏贴椰栗色娃谷羔笛撇梨星鹅篙兔丫婶豆桶膀凯漏坛局顺茬弯胚秃尖段柿绊锲亭檩岔锥绸簪辫梆缎洞橛板茧瞳筏竹妹曲眸招窑痞嫂折燕肘码主桃林褂腿丸式婢戏法浮妃旗梁袜园辣槽坝橘蹄拐根链匣锔棒坯苗芥李股片饺帐奶化位孙关骰塞篷班头老鹞虱茄骨婆梳台册鸭坠调馆褥卷担蝎阵性棚壳砧乐场垛孢雹案空步款篮铺锅点瘸斧梭轿本钩车舅粽碟镯稿流炉聋带宅里椽家窗瓜妻侄骗贩摊厨牌果鬼桩秆饼扣勺引马须爷蛋呆婊帖渣沙包妮刽乱筷种伙嗓胆肠蚊儿单疯被跛身村幌池孩崽探脖路小筛鞋绳鸽帘靴枪门铜辈锤吊袖瘦金银瞎汉叉柚哨麻罐杯珠耗个句梯印盖鞍靶毯袋盒裙砂掸样脑柱笼箱爪豹虫叶椅罩影猴傻狮矮瓶袍胡扇镇钉寨盘镜桌架轮格刀模夹杆日鼻皮料裤口筒肚屋领帽胖棍圈麦面巷房例柜管院凿铲凳套刷刨锯钳鞭垫镊]子[^弹弟女民爵]"
					,"^.[四几半一这两]下子|^.(这挡|什劳|[这副个对]对|新娘|耳刮|并肩|抽冷|)子|^.小[^弟王男公女天皇娘世]子"],
		"搂lou1"		:"^...搂([头草财钱脑颈]|肩搭背)",
		"燕yan1"		:"^...燕[赵山王京国魏姬]",
		"菲fei3"		:"^...菲[仪才酌薄]|^..不菲",
		"臭xiu4"		:"^..无臭",
		"乾gan1"		:"^..桑乾河",
		"仔zi3"		:"^...仔细|^..仔仔细细",
		"石dan4"		:"^...石谷|^..[十百千万]石[^柱像腭]|^.*[粮粟].*石|^.*石.*[粮粟]",
		"属zhu3"		:"^..[^纯]属意|^.举酒属客",
		"秘bi4"		:"^...秘鲁",
		"南na1"		:"...南无阿弥",
		"台tai1"		:"^...台州",
		"压ya4"		:"^..压根儿",
		"据jv1"		:"^..拮据",
		"模mu2"		:"^...模[板具样子]|^..铸模",
		"撩liao2"	:"^...撩([人乱拨得弄拔动首心逗]|虎须)|^..不撩",
		"撩liao4"	:"^...撩[倒翻到]",
		"趟tang4"	:"^..[一二两三四七六八九十几这了回上走跑出此那多少数整今拿赶空]趟|^...趟子手|^.[^敢会][来去]趟[^浑混水][^浑混水][^浑混水]",
		"尉yv4"		:"^...尉迟",
		"咳hai1"		:"^..#咳#",
		"勾gou4"		:"^...勾当",
		"肚du3"		:"^..[猪牛羊毛]肚[^皮腹子]|^..爆肚儿|^...肚片儿",
		"冠guan4"	:"^..[才功艳宠戾勇雄名学弱及加而夺绝]冠|^..[^树王皇桂后凤发龙]冠[以为于英胜勋绝名以誉杰决姓亚词礼群居]|^...冠军|^..双冠王|^.三连冠|^...冠三军|^速度为冠|^为天下冠|^(.应该|.可以|.足以|..不|.全要|.适合|.分别|..还|.接连|..被|又被.)冠上|^...冠上(个|了|一个)",
		"更geng1"	:"^...更[夫名漏鼓改衣换替新始迭正迁]|^..深更半夜|^..[五四三二一两变打开]更[^加多是大]|^.自力更生|^.少不更事|^...更年期|^.改弦更张",
		"扇shan4"	:"^...扇[子形骨柄刀窗页面贝型坠状门里叶前影]|^..[一那两这羽整宝折摇门窗毛小团风纸蒲凉纱玉半六隔击持拍握舞刀打挥柄收肉双蝶壁摺香罗火彩雨雀某四气几十执拿执举大木锦神圆三电檀逐纨哪挂撑吊园伞元]扇[^翅着了去]|^.(芭蕉|合欢|美人|销魂|山河|香妃|凤凰|桃花)扇|^..扑扇似的|^.[^有]如扇|^.[^没只]有扇[^动]|^...扇.门|^.一扇扇[^去]",
		"倔jve2"		:"^...倔[强犟起]",
		"哄hong1"	:"^...哄[哄动笑抢然闹堂响鸣叫地咔传抬乱出天赶要]|^.[^哄][一哄嘛哈闹迷]哄|^..#哄#|^...哄的一声",
		"哄hong4"	:"^..起哄|^起什么哄|^.起了哄|^..内哄",
		"叉cha3"		:"^..裤叉|^..腿叉[在开得]|^...叉开.*腿",
		"叉cha4"		:"^...叉[开路入道部]|^..[每两三四七分开劈枝树踢高丫]叉|^.(劈着|分了|好多)叉|^...叉了道",
		"杆gan3"		:"^..[箭长光一二双三四五六十七八九十余百千杠枪那几#腰麦两带铁笔朱木短鞭摇这拉秸多控笔着推柄粗苇粱刀扛动纵送草轴戟矛衡数烟锤]杆|^...杆[面柄状菌]|^..一杆杆|^.一杆杆|^曲轴连杆|^..连杆曲轴",
		"杆gan1"		:"^..[一二八]杆子|日上三杆|^.第.杆[^枪][^枪][^枪]|^..一杆一杆|^一杆一杆|^..几杆子|^.打几杆[^钉]|^...杆.*([洞]|[球][^迷]|击落|挥出|成绩|出去|水准)|^(罚去|落后).杆|^..这杆不算|^..一杆下去|^.玩两杆",
		"咯luo4"		:"^..[^#咯]咯#",
		"咯ka3"		:"^...咯.*[血痰口]|^..[血痰口]咯|^.[血痰口].咯|^[血痰口]..咯",
		"泊po1"		:"^..[湖血泊布山水镜罗]泊|^...泊[泊利尔罗]",
		"宿xiu3"		:"^..[一半三]宿[^舍]",
		"宿xiu4"		:"^..[星天八换七昴昂斗五六]宿[^营主舍]|^...宿.*星",
		"咽yan1"		:"^...咽[喉部候]",
		"咽ye4"		:"^..[呜哽抽咽凝幽如哏泣艰哭哑埂]咽|^...咽[得死到]",
		"仆pu1"		:"^..前仆后|^..[颠欲]仆|^..[^魔家奴神女仆]仆[倒着街下到刀跪]|^...仆.*(倒地|地上)|^.*[往一]前.*仆",
		"载zai3"		:"[半一二两三四五六七八九十百千万数余几加连登记承永转下据所明]载|载[入体]|[志册刊史籍书].*载|^...载.*[志册刊史籍书]|^...载.*内容|^.十多载",
		"唉ai4"		:"^...唉#",
		"夹jia2"		:"^...夹[层克棉袍裤被袄衫衣]",
		"彷pang2"	:"^...彷徨",
		"铺pu4"		:"^..[当每鱼几家摊门通酱酒店商卧药匠床粥铁车通卦老茶鞋]铺|^..[油地下的金外火外当大米小肉]铺[^平展散到回洒陈天着上了成在得设路张开垫一就满砌地好瓦放出叠盖]|^.(五里|丝绸|绸料|武器|石桥|果子|成衣|修理|烧饼|染料|颜料|铁器|裁缝|杂货|绸缎|兵器|棺材|扎纸|小吃|水果|包子|打地|药材|作坊)铺|^...铺[底子位面]|^.[^几顶道面路子地床板车][上下]铺([的#说坐住是去跳了上兼]|打扫|位置|一跃|一伸|上边|吊下|抱着)",
		"刹sha1"		:"^..[^罗]刹[住车进灭刀刹的往在出气停死了]|^..[前后急猛手]刹|^...刹不住",
		"卒cu4"		:"^..仓卒|^...卒[死然][^伤去在得]|^...卒不及防",
		"核hu2":		"^..[麻桃果杏橘枣扁]核[^实]|^...核儿",
		"丧sang1"	:"^..[婚奔嚎报吊大服守发举送喜号治国朝居三瞒出俗]丧[^失气权]|^...丧[事服礼旗期主葬鼓娶死布灯带刀送仪]|^.(娘的|妈个|三年|夫之)丧|^..[^尽]丧之[后身礼]|^..家丧时候|^..白丧的|^[报嚎]什么丧|^(三年之|有喜有)丧|^...丧中带喜|^..久丧等合",
		"省xing3"	:"^..[反自深未惊痛]省|^...省[亲悟]|^..三省.身|^人事不省|^..不省人事",
		"耶ye2"		:"^...耶#",
		"济ji3"		:"^..[^赈]济[济阴南阳宁北水州]|^..济济",
		"摩ma1"		:"^...摩挲",
		"溜liu4"		:"^..一溜|^.一大溜|^.一溜溜",
		"爪zhua3"	:"^..[鸟蟹鸡狗猫八]爪|^...爪子",
		"勒lei1"		:"^..[^构钩弥瓦摩菲梅斯米格科迦泰勾日米希格特迦图彼贝柏石谷獭]勒[昏了的著得上死住破伤着缰紧断我痕在勒停为入成下毙到掉绳颈起疆晕折脖碎暴爆翻向黑过出进]|^..[紧愈直猛一被]勒[^令索]|^.勒了勒|^.(怎么|绳子|长丝)勒|^...勒(惊马|了进来|转马|个正着)",
		"劈pi3"		:"^...劈叉|[把堆捆根].*劈柴[^刀]|^...劈柴.*[多足]|^.油的劈柴|^.劈.劈柴|^...劈柴烧着",
		"缝feng2"	:"^..[裁眯重可手续]缝|^...缝[绣一制纫合上衣补针过韧织起得做住好着死了在缝皮成线入个伤进缀满有出到痕]|^..[^没]缝的",
		"漂piao4"	:"^...漂亮|^...漂漂亮亮",
		"漂piao3"	:"^...漂[染白洗]",
		"炮pao2"		:"^...炮制[^造]",
		"采cai4"		:"^...采邑",
		"迫pai3"		:"^...迫击炮",
		"啦la1"		:"^..啦啦队|^...啦啦队",
		"旋xuan4"	:"^...旋风|打.*旋|^...旋儿",
		"节jie1"		:"^...节骨眼",
		"蛇yi2"		:"^..委蛇",
		"炸zha2"		:"[油][来里给]炸|[油烹]炸[^弹药开裂]|炸[薯鳗鱼饼丸豌鸡肉藕]|[煎炒烹]|锅.*炸[^裂]|^...炸的出来|炸上一炸|^...炸烧饼",
		"纤qian4"	:"^...纤[夫绳]|^..拉纤",
		"脉mo4"		:"^...脉脉|^..脉脉",
		"悄qiao3"	:"^...悄[寂然声]",
		"抢qiang1"	:"^..[天头]抢地",
		"量liang2"	:"[^份血容含分动当求掂音重估商变尽力能商大无思少数估限质打衡考掂批酒度出较]量([体天血身衣珠杯量完尺具脚]|(人家|了一|一下|一量|出了|出来)|.(温度|步子|身高|尺寸)|.*身)|[^配][比丈称测再衡一]量[^级]|(怎么|已经|也要)量|[秤尺].*量|[^商打]量了(量|几下|好久)",
		"吐tu4"		:"(血|喝|喉咙|侧身|秽物|酒).*吐|[大特催呕]吐|吐得|吐[出了一].*口|吐.*([血沫]|口水)",
		"抹mo4"		:"^.拐弯抹角",
		"抹ma1"		:"^...抹(布|.*脸|[过起]桌)",
		"度duo2"		:"^..[踹自揣猜审忖妄测思]度[^量过]|^..[^印力限极制温大强国态速难程高气幅角]度[势之][^内外间高后地中快下大前疾多赐]|^.以己度人",
		"创chuang4"	:"^..[能自独所再开首原擅手]创|^..[^重]创[此作造建世办始意立新界天出级之下举业设了基]",
		"挣zheng1"	:"^...挣[抢臣拒扭将锢强相掉坐气逃狞烂拧扎脱断开红起裂动位过破出飞成取][^利]|^..[抗一之强]挣|^...挣[^钱].*[卖拷红下脱抢身次圆动扭咯俏]|[与链肌].*挣|^...挣不[起开断]|^..别挣了|挣了.*挣",
		"磨mo4"		:"^...磨[盘坊眼房头]|^..[^水]磨石|^..拉磨[^成砺牙擦]|^.[^沙]石磨[^成砺牙擦]|^.驴上磨|^..小磨[^成砺牙擦]",
		"薄bao2"		:"薄.*[片饼层板]",
		"薄bo4"		:"^...薄荷",
		"肖xiao4"	:"^...肖像|^..不肖",
		"占zhan1"	:"^..[^强]占[算星卜卦盘象验气测仙筮龟]|^..[扶鬼灵]占[^据便领]|^...占了一卦",
		"番pan1"		:"^...番禺",
		"稍shao4"	:"^...稍息",
		"呀ya1"		:"^..#呀#",
		"扫sao4"		:"^...扫[帚把]",
		"哦e2"		:"^..吟哦",
		"洗xian3"	:"^...洗星海",
		"供gong4"	:"^..[逼串招口翻诱上证进攀纳迫笔诈反]供[^给应游氧]|^..[^提可]供([职奉词桌品果认出着在述证案佛献物纸状了神]|台[^海]|的是|.*(长生|大仙|菩萨|牌|佛|圣|神位)|起[^事])|^.招了供",
		"涨zhang3"	:"[^脸鼓]*涨[^大红]*[需求食薪钱跌消租酬钱资倍费股粮价税金倍跌缩落百二十几万块]|^[^脸]*[票猛数大上飞大疯看特水高再见此彼陡忽潮暴爆需求食薪钱跌消租酬钱资倍费股粮价税金]涨[^脸]*|[需求食薪钱跌消租酬钱资倍费股粮价税金].*[^#]涨[^脸]*|[^鼓硬肥点]涨涨",
		"钻zuan4"	:"^...钻[子头石戒类矿针锥金枪型刺]|^..[名戟巨枪风棱毛粉金光黑晶火蓝钢铁水红电碎额铜彩神星骨翠镶耳]钻[^过入进心出地]|^.(毒龙|金刚|宝石|天然)钻|[铣]*钻*[铣]|^...钻床[^底]",
		"撒sa1"		:"^...撒.*[蹄腿尿谎娇丫泡疯欢马赖冷气手泼野脚火]|^...撒[丁加拿旦哈巴仑克多]|^..[拉弥侬克恺罗帕巴]撒|[腿尿谎娇泡疯欢赖气野脚].*撒[^盐过上着]",
		"冒mo4"		:"^...冒顿",
		"顿du2"		:"^..冒顿",
		"颤zhan4"	:"^...颤栗",
		"吓he4"		:"^..[恐恫]吓",
		"种zhong3"	:"^..[这那哪一二两三四五六七八九十百千各几有某多变兵火数物名绝没带异孬特万纯品杂树血灭何圣配同结龙借白黑军舰孽遗仙矮语良机诸犟育税情每作舞余坏野换猪贱蛮亡丹黄拳船亚属马币谷]种|^...种[类族群子籽猪马留]|种种|^.(多少|低等|中等|高等|部落|风流|绝了|有了|十来)种|^..[是人此之的]种[^入在田地下了植有树的上出]",
		"盛cheng2"	:"^..[^花正日渐极阳越昌过太最旺强兴气丰大鼎茂全之更繁转]盛[满着纳饭在好碗汤上到殓食载出些酒器水来钱接土有起点菜粥肉米殄敛粪下住]|^...盛(舍利|不了|过来|饺子|不下|零嘴)|^..[^强旺最]盛的.*[是]|^..[^旺鼎更强昌越之气太过丰大都自]盛了|[^草花开][^草花开][^丰花般如光梅朵莲]盛放[^出]",
		"缩su4"		:"^...缩砂",
		"晕yvn4"		:"^.水生晕|晕.*[脸颊]|[颊脸].*晕|^..[斑银金虹血彩酒水紫桃流含余泛双圆灯红光微霞乳粉月薄娇媚眼]晕|^...晕[红黄淡颊彩剑机灯纹色散染霞光眩炫车场船针高血开出]|^...晕着脸",
		"别bie4"		:"^...别扭",
		"累lei2"		:"^...累赘",
		"累lei3"		:"^...累[建至族经叠败增曲及生创次月积牍计卵万年升迁加代世功铢]|^..[积月]累|累累|^...累.*[盘世]|^...累军功",
		"乘sheng4"	:"^..[一二三四五六七八九十百千万]乘[^以]",
		
		"为wei2":"为乐",
		"乐le4":"为乐",
		"倒dao4":"倒也",
		"只zhi3":"只有|只以",

		"@":"@"
	};

}

